// Завдання: Визначити, чи є задане число досконалим. 
int main() { 	// Точка входу
  int n = 6; // Число, яке треба перевірити
  int sum = 0; // Допоміжна змінна, яка буде зберігати в собі суму всіх дільників числа, яке треба перевірити
  int check = 0; // Змінна, яка зберігає інформацію, чи є число досконалим (0 - не досконале, 1 - досконале)
  for (int i = 1; i < n; ++i) { // Цикл проходить по числу
    if (n % i == 0) { // Якщо число, яке треба перевірити ділиться націло на число, яке зараз у циклі (і)
      sum += i; // Додаємо до допоміжної змінної наше число у циклі
    }
  }
  if (n == sum) { // Якщо число, яке треба перевірити дорівнює числу яке в допоміжній змінній
    check = 1; // Число є досконалим
  }
  return 0;
}
