/**
 * @mainpage
 * # Загальне завдання
 * 25) Визначити, чи є ціле 6-ти значне число "щасливим" квитком
 * 
 * @author Diakova A.
 * @date 19-dec-2022
 * @version 1.0
 */

/**
 * @file main.c
 *
 * @brief Цей файл головний та єдиний файл у програмі.
 *
 *
 * @author Diakova A.
 * @date 19-dec-2022
 * @version 1.0
 */

/**
 * Перевіряє, чи є число досконалим.
 *
 * Спочатку цикл проходить по введеному числу (від 0 до цього числа), якщо це число кратне тому, що у циклі зараз, то те що у циклі додається до змінної sum. Далі, якщо введене
 * число дорівнює тому, що вийшло в sum, то повертае 1(число є досконалим).
 *
 */
int perfect(int n);

/**
 * Головна функція.
 *
 * Послідовність дій:
 * - викликає функцію perfect;
 */
int main()
{
	int n = 6;

	int result = perfect(n);

	return 0;
}

int perfect(int n)
{
	int sum = 0;
	int check = 0;
	for (int i = 1; i < n; ++i) {
		if (n % i == 0) {
			sum += i;
		}
	}
	if (n == sum) {
		check = 1;
	}
	return check;
}
